import sys
sys.stdin = open('1904.txt')

# 1은 1개씩, 0은 2개씩 붙여 사용 가능.
# ex) 1001 가능, 1100 가능, 1010 불가능(0이 하나씩 사용되었기 때문)

# n = 1 -> 1
# n = 2 -> 11, 00
# n = 3 -> 100, 001, 111
# n = 4 -> 1111, 1100, 1001, 0011, 0000
# n = 5 -> 11111, 10000, 00100, 00001, 11100, 11001, 10011, 00111

n = int(input())
if n == 1:
    print(1)
elif n == 2:
    print(2)
else:
    dp = [0] * (n + 1) # dp[n] = 만들 수 있는 n자릿수의 개수
    dp[1] = 1
    dp[2] = 2

    for i in range(3, n + 1): # 1 ~ n번째 까지
        dp[i] = (dp[i - 1] + dp[i - 2])%15746

    print(dp[n])